Revit 2026 API

# RevitAPISingleEventArgs Class

---

The class is used as a base class for arguments of any single-event.

SystemObject SystemEventArgs Autodesk.Revit.DB.EventsRevitAPIEventArgs Autodesk.Revit.DB.EventsRevitAPISingleEventArgs More

**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RevitAPISingleEventArgs : RevitAPIEventArgs
```
```vb
Public Class RevitAPISingleEventArgs
	Inherits RevitAPIEventArgs
```
```cpp
public ref class RevitAPISingleEventArgs : public RevitAPIEventArgs
```
```fsharp
type RevitAPISingleEventArgs =
    class
        inherit RevitAPIEventArgs
    end
```

The RevitAPISingleEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Cancellable | Indicates whether an event may be cancelled by an event delegate. (Inherited from RevitAPIEventArgs) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RevitAPIEventArgs) |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from RevitAPIEventArgs) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsCancelled | Indicates whether the event is being cancelled. (Inherited from RevitAPIEventArgs) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

A single event is an event that is not directly related to another event, meaning that there is no corresponding pre-event or post-event surrounding a single event.

#### Reference

Autodesk.Revit.DB.Events Namespace

SystemObject SystemEventArgs Autodesk.Revit.DB.EventsRevitAPIEventArgs Autodesk.Revit.DB.EventsRevitAPISingleEventArgs Autodesk.Revit.DB.EventsApplicationInitializedEventArgs Autodesk.Revit.DB.EventsDocumentChangedEventArgs Autodesk.Revit.DB.EventsDocumentWorksharingEnabledEventArgs Autodesk.Revit.DB.EventsFailuresProcessingEventArgs Autodesk.Revit.DB.EventsProgressChangedEventArgs Autodesk.Revit.DB.EventsWorksharedOperationProgressChangedEventArgs Autodesk.Revit.UI.EventsDockableFrameFocusChangedEventArgs Autodesk.Revit.UI.EventsDockableFrameVisibilityChangedEventArgs Autodesk.Revit.UI.EventsExternalDataManagerChangedEventArgs Autodesk.Revit.UI.EventsFabricationPartBrowserChangedEventArgs Autodesk.Revit.UI.EventsMacroUpdatedEventArgs Autodesk.Revit.UI.EventsSelectionChangedEventArgs Autodesk.Revit.UI.EventsThemeChangedEventArgs Autodesk.Revit.UI.EventsTransferredProjectStandardsEventArgs